## 2 Series - Pandas

https://pandas.pydata.org/docs/index.html

In [240]:
pip install pandas

Requirement already satisfied: pandas in c:\users\josesimao\anaconda3\lib\site-packages (1.4.2)Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\josesimao\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\josesimao\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\josesimao\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\josesimao\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Could not fetch URL https://pypi.org/simple/pip/: There was a problem confirming the ssl certificate: HTTPSConnectionPool(host='pypi.org', port=443): Max retries exceeded with url: /simple/pip/ (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: self signed certificate in certificate chain (_ssl.c:1129)'))) - skipping

In [241]:
import numpy as np
import pandas as pd

In [242]:
np.__version__

'1.21.5'

In [243]:
pd.__version__

'1.4.2'

#### 2.0.1 Criando uma Serie

In [244]:
labels = ['A','B','C']
lista = [10,20,30]
array = np.array([100,200,300])
dict = {'a1':10, 'b1':20, 'c1':30}

In [245]:
labels

['A', 'B', 'C']

In [246]:
lista

[10, 20, 30]

In [247]:
array

array([100, 200, 300])

In [248]:
dict

{'a1': 10, 'b1': 20, 'c1': 30}

#### ** Usando listas **

In [249]:
pd.Series(data=lista)

0    10
1    20
2    30
dtype: int64

In [250]:
pd.Series(data=lista, index=labels)

A    10
B    20
C    30
dtype: int64

In [251]:
pd.Series(lista, labels)

A    10
B    20
C    30
dtype: int64

#### ** NumPy Arrays **

In [252]:
pd.Series(array)

0    100
1    200
2    300
dtype: int32

In [253]:
pd.Series(data=array, index=labels)

A    100
B    200
C    300
dtype: int32

#### ** Dicionários **

In [254]:
pd.Series(dict)

a1    10
b1    20
c1    30
dtype: int64

#### 2.0.2 Dados nas Series

In [255]:
pd.Series(data=labels)

0    A
1    B
2    C
dtype: object

#### Funções

In [256]:
pd.Series([print,sum,len])

0    <built-in function print>
1      <built-in function sum>
2      <built-in function len>
dtype: object

#### 2.1 Usando um Índice

In [257]:
serie1 = pd.Series([10,20,30,40], index=['BRASIL','EUA','RUSSIA','AFRICA DO SUL'])
serie1

BRASIL           10
EUA              20
RUSSIA           30
AFRICA DO SUL    40
dtype: int64

In [258]:
serie2 = pd.Series([1,2,3,4], index=['BRASIL','JAPÃO','RUSSIA','ALEMANHA'])
serie2

BRASIL      1
JAPÃO       2
RUSSIA      3
ALEMANHA    4
dtype: int64

In [259]:
serie1['EUA']

20

In [260]:
type(serie1)

pandas.core.series.Series

In [261]:
type(serie1['EUA'])

numpy.int64

##### As operações também são feitas com base no índice:

In [262]:
serie1

BRASIL           10
EUA              20
RUSSIA           30
AFRICA DO SUL    40
dtype: int64

In [263]:
serie2

BRASIL      1
JAPÃO       2
RUSSIA      3
ALEMANHA    4
dtype: int64

In [264]:
serie1+serie2

AFRICA DO SUL     NaN
ALEMANHA          NaN
BRASIL           11.0
EUA               NaN
JAPÃO             NaN
RUSSIA           33.0
dtype: float64

In [265]:
serie1-serie2

AFRICA DO SUL     NaN
ALEMANHA          NaN
BRASIL            9.0
EUA               NaN
JAPÃO             NaN
RUSSIA           27.0
dtype: float64

## 3 DataFrame - Criação e Fatiamento

In [315]:
import pandas as pd
import numpy as np

In [316]:
np.random.seed(101)

In [317]:
df = pd.DataFrame(data=np.random.randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [318]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [319]:
type(df)

pandas.core.frame.DataFrame

In [320]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [321]:
df.Z

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [322]:
df['novo'] = df['X']+df['Y']

In [323]:
df

          W         X         Y         Z      novo
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [324]:
df.drop(columns='novo')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [325]:
df

          W         X         Y         Z      novo
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [326]:
df.drop('novo', axis=1, inplace=True)

In [327]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [328]:
df.loc['e'.upper()]

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

In [329]:
df.loc[['B','C']]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [330]:
df.loc['B','Z']

0.6059653494949336

In [331]:
type(df.loc['A','Z'])

numpy.float64

In [332]:
df.loc[['A','B','E'], ['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
E  1.978757  2.605967

In [333]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [334]:
df.iloc[1] ## B

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [335]:
df.iloc[0:3]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [336]:
df.iloc[0:4][3:]

          W         X         Y         Z
D  0.188695 -0.758872 -0.933237  0.955057

In [337]:
df.iloc[3][0:2]

W    0.188695
X   -0.758872
Name: D, dtype: float64

## 4 DataFrame - Seleção Condicional

In [338]:
bol = df != 0
bol

      W     X     Y     Z
A  True  True  True  True
B  True  True  True  True
C  True  True  True  True
D  True  True  True  True
E  True  True  True  True

In [339]:
df[bol]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [340]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [341]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [342]:
df[df['X']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [343]:
df[df['X']>0]['Z']

A    0.503826
C   -0.589001
E    0.683509
Name: Z, dtype: float64

In [344]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [345]:
bol1=df['X']>0
df2=df[bol1]
df2

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [346]:
# And
df[(df['X']>0) & (df['Z']<0)]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [347]:
df[(df['Y']<0) & (df['Z']<.7)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965

In [348]:
# Or
df[(df['W']>2) | (df['Y']>=2)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [349]:
df[(df['W']<0) | (df['Y']>2)]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [350]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [351]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [352]:
df.reset_index(inplace=True)

In [353]:
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [354]:
col = 'RJ SP AM RO TO'.split()
col

['RJ', 'SP', 'AM', 'RO', 'TO']

In [355]:
df['Estado']=col

In [356]:
df

  index         W         X         Y         Z Estado
0     A  2.706850  0.628133  0.907969  0.503826     RJ
1     B  0.651118 -0.319318 -0.848077  0.605965     SP
2     C -2.018168  0.740122  0.528813 -0.589001     AM
3     D  0.188695 -0.758872 -0.933237  0.955057     RO
4     E  0.190794  1.978757  2.605967  0.683509     TO

In [357]:
df.set_index('Estado')

       index         W         X         Y         Z
Estado
RJ         A  2.706850  0.628133  0.907969  0.503826
SP         B  0.651118 -0.319318 -0.848077  0.605965
AM         C -2.018168  0.740122  0.528813 -0.589001
RO         D  0.188695 -0.758872 -0.933237  0.955057
TO         E  0.190794  1.978757  2.605967  0.683509

In [358]:
df

  index         W         X         Y         Z Estado
0     A  2.706850  0.628133  0.907969  0.503826     RJ
1     B  0.651118 -0.319318 -0.848077  0.605965     SP
2     C -2.018168  0.740122  0.528813 -0.589001     AM
3     D  0.188695 -0.758872 -0.933237  0.955057     RO
4     E  0.190794  1.978757  2.605967  0.683509     TO

In [359]:
df.set_index('Estado', inplace=True)

In [360]:
df

       index         W         X         Y         Z
Estado
RJ         A  2.706850  0.628133  0.907969  0.503826
SP         B  0.651118 -0.319318 -0.848077  0.605965
AM         C -2.018168  0.740122  0.528813 -0.589001
RO         D  0.188695 -0.758872 -0.933237  0.955057
TO         E  0.190794  1.978757  2.605967  0.683509

## Dataframe - Indice Multinível

In [376]:
import pandas as pd
import numpy as np

In [377]:
outside=np.array(['G1','G1','G1','G2','G2','G2'])
inside=np.array([1,2,3,1,2,3])
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [378]:
outside

array(['G1', 'G1', 'G1', 'G2', 'G2', 'G2'], dtype='<U2')

In [379]:
inside

array([1, 2, 3, 1, 2, 3])

In [380]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [381]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns='coluna1 coluna2'.split())

In [382]:
df

       coluna1   coluna2
G1 1  1.025984 -0.156598
   2 -0.031579  0.649826
   3  2.154846 -0.610259
G2 1 -0.755325 -0.346419
   2  0.147027 -0.479448
   3  0.558769  1.024810

In [383]:
df.loc['G1']

    coluna1   coluna2
1  1.025984 -0.156598
2 -0.031579  0.649826
3  2.154846 -0.610259

In [384]:
df.iloc[3]

coluna1   -0.755325
coluna2   -0.346419
Name: (G2, 1), dtype: float64

In [385]:
type(df.loc['G2'])

pandas.core.frame.DataFrame

In [388]:
df.loc['G1'].loc[2]

coluna1   -0.031579
coluna2    0.649826
Name: 2, dtype: float64

In [389]:
type(df.loc['G1'].loc[2])

pandas.core.series.Series

In [390]:
df.index.names

FrozenList([None, None])

In [405]:
df.index.names=['Grupo', 'Numero']
df

               coluna1   coluna2
Grupo Numero
G1    1       1.025984 -0.156598
      2      -0.031579  0.649826
      3       2.154846 -0.610259
G2    1      -0.755325 -0.346419
      2       0.147027 -0.479448
      3       0.558769  1.024810

#### Cross-section (Seção cruzada) Com ele consigo pegar elementos do nivel interno sem a necessidade de passar parametros do nivél interno

In [406]:
df.xs('G1')

         coluna1   coluna2
Numero
1       1.025984 -0.156598
2      -0.031579  0.649826
3       2.154846 -0.610259

In [407]:
df

               coluna1   coluna2
Grupo Numero
G1    1       1.025984 -0.156598
      2      -0.031579  0.649826
      3       2.154846 -0.610259
G2    1      -0.755325 -0.346419
      2       0.147027 -0.479448
      3       0.558769  1.024810

In [409]:
df.xs(2, level='Numero')

Grupo
G1    0.649826
G2   -0.479448
Name: coluna2, dtype: float64

In [410]:
df.xs(2, level='Numero')["coluna2"]

Grupo
G1    0.649826
G2   -0.479448
Name: coluna2, dtype: float64

In [412]:
df=pd.DataFrame({'A':[1,2,np.nan],
                'B':[5,np.nan,np.nan],
                'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3